Revit 2024 API
OverrideGraphicSettings.SurfaceForegroundPatternColor Property
 The override color of the surface foreground pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public Color SurfaceForegroundPatternColor { get; }
Visual Basic
Public ReadOnly Property SurfaceForegroundPatternColor As Color
	Get
Visual C++
public:
property Color^ SurfaceForegroundPatternColor {
	Color^ get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace